_Rarzrabotki/Kazna/InformationRegisters/СтоимостьПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/СтоимостьПродукции/Ext/ManagerModule.bsl
Функция ПолучитьЦену(НаДату,Подразделение, Номенклатура=Неопределено) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст=   "ВЫБРАТЬ
	                |	СтоимостьПродукцииСрезПоследних.Цена,
	                |	ВЫБОР
	                |		КОГДА СтоимостьПродукцииСрезПоследних.Подразделение = &Подразделение
	                |				И СтоимостьПродукцииСрезПоследних.Номенклатура = &Номенклатура
	                |			ТОГДА 1
	                |		КОГДА СтоимостьПродукцииСрезПоследних.Подразделение = &Подразделение
	                |			ТОГДА 2
					|		КОГДА СтоимостьПродукцииСрезПоследних.Номенклатура = &Номенклатура
	                |			ТОГДА 3
	                |		ИНАЧЕ 9
	                |	КОНЕЦ КАК Приоритет
	                |ИЗ
	                |	РегистрСведений.СтоимостьПродукции.СрезПоследних(&НаДату, ) КАК СтоимостьПродукцииСрезПоследних
	                |ГДЕ
	                |	(СтоимостьПродукцииСрезПоследних.Подразделение = &Подразделение
	                |			ИЛИ СтоимостьПродукцииСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	                |	И (СтоимостьПродукцииСрезПоследних.Номенклатура = &Номенклатура
	                |			ИЛИ СтоимостьПродукцииСрезПоследних.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Приоритет"   ;
	ЗАпрос.УстановитьПараметр("НаДату",НаДату);
	ЗАпрос.УстановитьПараметр("Подразделение",Подразделение);
	ЗАпрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Если Выборка.Следующий() Тогда
		Цена  = Выборка.Цена;
	Иначе
		Цена=  0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Цена;
КонецФункции // ()
